# Username Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BasicFileInfo..::..Username Property
BasicFileInfo Class See Also
---
Returns the username.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string Username { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Username As String
	Get
```

Visual C++
---
```text
public:
property String^ Username {
	String^ get ();
}
```

# See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace